In [56]:
import pandas as pd
import mysql.connector
from sqlalchemy import create_engine

In [57]:
engine = create_engine('mysql+mysqlconnector://student:pswd@localhost/country_club')

## Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

/*av. execution time 0.00016 sec*/

In [65]:
%%time
sql_str = """ SELECT name AS "facility_name" 
                FROM Facilities 
                WHERE membercost = 0 """
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

     facility_name
0  Badminton Court
1     Table Tennis
2    Snooker Table
3       Pool Table
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 1.95 ms

## Q2: How many facilities do not charge a fee to members?

/*av. execution time 0.0002 sec*/

In [66]:
%%time
sql_str = """ SELECT COUNT(*) AS "no_of_free_facilities" 
                FROM Facilities 
                WHERE membercost = 0 """
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

   no_of_free_facilities
0                      4
CPU times: user 31.2 ms, sys: 15.6 ms, total: 46.9 ms
Wall time: 2.68 ms

## Q3: How can you produce a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost?Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

/*av. execution time 0.0002 sec*/

In [67]:
%%time
sql_str = """ SELECT facid AS "facid",
                name AS "facility_name",
                membercost AS "member_cost" ,
                monthlymaintenance AS "monthly_maintenance" 
                FROM Facilities 
                WHERE membercost != 0 
                AND membercost < (0.2 * monthlymaintenance) """
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

   facid   facility_name member_cost  monthly_maintenance
0      0  Tennis Court 1         5.0                  200
1      1  Tennis Court 2         5.0                  200
2      4  Massage Room 1         9.9                 3000
3      5  Massage Room 2         9.9                 3000
4      6    Squash Court         3.5                   80
CPU times: user 15.6 ms, sys: 0 ns, total: 15.6 ms
Wall time: 2.98 ms

## Q4: How can you retrieve the details of facilities with ID 1 and 5? Write the query without using the OR operator.

/*av. execution time 0.00016 sec*/

In [68]:
%%time
sql_str = """ SELECT * 
                FROM Facilities 
                WHERE facid in (1,5)"""
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

   facid            name membercost guestcost  initialoutlay  \
0      1  Tennis Court 2        5.0      25.0           8000
1      5  Massage Room 2        9.9      80.0           4000

   monthlymaintenance
0                 200
1                3000
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 3.2 ms

## Q5: How can you produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than 100? Return the name and monthly maintenance of the facilities in question.

/*av. execution time 0.00018 sec*/

In [69]:
%%time
sql_str = """ SELECT name AS "facility_name", 
                monthlymaintenance AS "monthly_maintenance", 
                CASE 
                    WHEN monthlymaintenance > 100 THEN "expensive" 
                    ELSE "cheap" 
                    END AS "cheap_or_expensive"
                FROM Facilities """
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

     facility_name  monthly_maintenance cheap_or_expensive
0   Tennis Court 1                  200          expensive
1   Tennis Court 2                  200          expensive
2  Badminton Court                   50              cheap
3     Table Tennis                   10              cheap
4   Massage Room 1                 3000          expensive
5   Massage Room 2                 3000          expensive
6     Squash Court                   80              cheap
7    Snooker Table                   15              cheap
8       Pool Table                   15              cheap
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 2.99 ms

## Q6: You'd like to get the first and last name of the last member(s) who signed up. Do not use the LIMIT clause for your solution.

/*av. execution time 0.00024 sec*/

In [70]:
%%time
sql_str = """ SELECT joindate AS "signup_date", 
                firstname AS "first_name", 
                surname AS "last_name"
                FROM Members 
                WHERE joindate = 
                    (SELECT MAX(joindate) FROM Members) """
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

           signup_date first_name last_name
0  2012-09-26 18:08:45     Darren     Smith
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 2.74 ms

## Q7: How can you produce a list of all members who have used a tennis court? Include in your output the name of the court, and the name of the member formatted as a single column. Ensure no duplicate data, and order by the member name.

## two ways of writing this

## method 1 - using implicit join and no subquery 

/*av. execution time 0.00196 sec*/

In [71]:
%%time
sql_str = """ SELECT DISTINCT f.facid AS "facid",
                f.name AS "facility_name", 
                CASE 
                    WHEN m.memid = 0 THEN "Guest" 
                    ELSE concat(m.surname, concat(" ",m.firstname)) 
                    END AS "member_name"  
                FROM Bookings b, Facilities f, Members m
                WHERE b.facid = f.facid
                AND b.memid = m.memid
                AND f.name LIKE "%tennis court%"
                ORDER BY member_name """
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

    facid   facility_name        member_name
0       1  Tennis Court 2     Bader Florence
1       0  Tennis Court 1     Bader Florence
2       1  Tennis Court 2         Baker Anne
3       0  Tennis Court 1         Baker Anne
4       1  Tennis Court 2      Baker Timothy
5       0  Tennis Court 1      Baker Timothy
6       1  Tennis Court 2         Boothe Tim
7       0  Tennis Court 1         Boothe Tim
8       1  Tennis Court 2     Butters Gerald
9       0  Tennis Court 1     Butters Gerald
10      0  Tennis Court 1        Coplin Joan
11      0  Tennis Court 1      Crumpet Erica
12      0  Tennis Court 1         Dare Nancy
13      1  Tennis Court 2         Dare Nancy
14      1  Tennis Court 2      Farrell David
15      0  Tennis Court 1      Farrell David
16      0  Tennis Court 1     Farrell Jemima
17      1  Tennis Court 2     Farrell Jemima
18      0  Tennis Court 1    Genting Matthew
19      0  Tennis Court 1              Guest
20      1  Tennis Court 2              Guest
21      1  Tennis Court 2          Hunt John
22      0  Tennis Court 1          Hunt John
23      1  Tennis Court 2        Jones David
24      0  Tennis Court 1        Jones David
25      0  Tennis Court 1      Jones Douglas
26      0  Tennis Court 1    Joplette Janice
27      1  Tennis Court 2    Joplette Janice
28      1  Tennis Court 2       Owen Charles
29      0  Tennis Court 1       Owen Charles
30      0  Tennis Court 1       Pinker David
31      1  Tennis Court 2  Purview Millicent
32      0  Tennis Court 1         Rownam Tim
33      1  Tennis Court 2         Rownam Tim
34      1  Tennis Court 2   Rumney Henrietta
35      0  Tennis Court 1   Sarwin Ramnaresh
36      1  Tennis Court 2   Sarwin Ramnaresh
37      1  Tennis Court 2       Smith Darren
38      1  Tennis Court 2         Smith Jack
39      0  Tennis Court 1         Smith Jack
40      0  Tennis Court 1        Smith Tracy
41      1  Tennis Court 2        Smith Tracy
42      0  Tennis Court 1    Stibbons Ponder
43      1  Tennis Court 2    Stibbons Ponder
44      0  Tennis Court 1       Tracy Burton
45      1  Tennis Court 2       Tracy Burton
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 7.78 ms

## method 2 - using explicit join and subquery

/*av. execution time 0.00254 sec*/

In [72]:
%%time
sql_str = """ SELECT DISTINCT bf.facid AS "facid",
                bf.name AS "facility_name", 
                CASE 
                    WHEN m.memid = 0 THEN "Guest" 
                    ELSE concat(m.surname, concat(" ",m.firstname)) 
                    END AS "member_name"
                FROM
                
                /* subquery joining Bookings and Facilities as table bf */
                (SELECT f.facid AS "facid",
                    f.name AS "name", b.memid AS "memid"
                    FROM Bookings b 
                    JOIN Facilities f
                    ON b.facid = f.facid
                    AND f.name LIKE "%tennis court%") bf
                    
                JOIN Members m
                ON bf.memid = m.memid
                ORDER BY member_name """
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

    facid   facility_name        member_name
0       1  Tennis Court 2     Bader Florence
1       0  Tennis Court 1     Bader Florence
2       0  Tennis Court 1         Baker Anne
3       1  Tennis Court 2         Baker Anne
4       1  Tennis Court 2      Baker Timothy
5       0  Tennis Court 1      Baker Timothy
6       0  Tennis Court 1         Boothe Tim
7       1  Tennis Court 2         Boothe Tim
8       0  Tennis Court 1     Butters Gerald
9       1  Tennis Court 2     Butters Gerald
10      0  Tennis Court 1        Coplin Joan
11      0  Tennis Court 1      Crumpet Erica
12      1  Tennis Court 2         Dare Nancy
13      0  Tennis Court 1         Dare Nancy
14      0  Tennis Court 1      Farrell David
15      1  Tennis Court 2      Farrell David
16      0  Tennis Court 1     Farrell Jemima
17      1  Tennis Court 2     Farrell Jemima
18      0  Tennis Court 1    Genting Matthew
19      1  Tennis Court 2              Guest
20      0  Tennis Court 1              Guest
21      0  Tennis Court 1          Hunt John
22      1  Tennis Court 2          Hunt John
23      0  Tennis Court 1        Jones David
24      1  Tennis Court 2        Jones David
25      0  Tennis Court 1      Jones Douglas
26      0  Tennis Court 1    Joplette Janice
27      1  Tennis Court 2    Joplette Janice
28      0  Tennis Court 1       Owen Charles
29      1  Tennis Court 2       Owen Charles
30      0  Tennis Court 1       Pinker David
31      1  Tennis Court 2  Purview Millicent
32      1  Tennis Court 2         Rownam Tim
33      0  Tennis Court 1         Rownam Tim
34      1  Tennis Court 2   Rumney Henrietta
35      1  Tennis Court 2   Sarwin Ramnaresh
36      0  Tennis Court 1   Sarwin Ramnaresh
37      1  Tennis Court 2       Smith Darren
38      1  Tennis Court 2         Smith Jack
39      0  Tennis Court 1         Smith Jack
40      1  Tennis Court 2        Smith Tracy
41      0  Tennis Court 1        Smith Tracy
42      0  Tennis Court 1    Stibbons Ponder
43      1  Tennis Court 2    Stibbons Ponder
44      0  Tennis Court 1       Tracy Burton
45      1  Tennis Court 2       Tracy Burton
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 5.83 ms

## Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than 30? Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted as a single column, and the cost. Order by descending cost, and do not use any subqueries.

/*av. execution time 0.00072 sec*/

In [73]:
%%time
sql_str = """ SELECT f.name AS "facility_name",

                /*when guest, use Guest as name otherwise conact surname with firstname */
                CASE 
                    WHEN m.memid = 0 THEN "Guest" 
                    ELSE concat(m.surname, concat(" ",m.firstname)) 
                    END AS "member_name", 
                    
                /*when guest, use guestcost otherwise use membercost */ 
                CASE 
                    WHEN m.memid = 0 THEN (f.guestcost * b.slots) 
                    ELSE (f.membercost * b.slots) 
                    END AS "cost" 
                    
                FROM Bookings b, Members m, Facilities f
                WHERE b.memid = m.memid
                AND b.facid = f.facid
                AND LEFT(b.starttime,10) = "2012-09-14"
                
                /*when guest, use guestcost otherwise use membercost */
                AND ( CASE 
                        WHEN m.memid = 0 THEN (f.guestcost * b.slots) > 30 
                        ELSE (f.membercost * b.slots) > 30 
                        END )
                        
                ORDER BY cost DESC """
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

     facility_name     member_name   cost
0   Massage Room 2           Guest  320.0
1   Massage Room 1           Guest  160.0
2   Massage Room 1           Guest  160.0
3   Massage Room 1           Guest  160.0
4   Tennis Court 2           Guest  150.0
5   Tennis Court 1           Guest   75.0
6   Tennis Court 1           Guest   75.0
7   Tennis Court 2           Guest   75.0
8     Squash Court           Guest   70.0
9   Massage Room 1  Farrell Jemima   39.6
10    Squash Court           Guest   35.0
11    Squash Court           Guest   35.0
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 4.09 ms

## Q9: This time, produce the same result as in Q8, but using a subquery.

/*av. execution time 0.00075 sec*/

In [74]:
%%time
sql_str = """ SELECT f.name AS "facility_name",

                /*when guest, use Guest as name otherwise conact surname with firstname */
                CASE 
                    WHEN bm.memid = 0 THEN "Guest" 
                    ELSE concat(bm.surname, concat(" ",bm.firstname)) 
                    END AS "member_name",  
                    
                /*when guest, use guestcost otherwise use membercost */
                CASE 
                    WHEN bm.memid = 0 THEN (f.guestcost * bm.slots) 
                    ELSE (f.membercost * bm.slots) 
                    END AS "cost"
                    
                FROM
                
                /*subquery joining Bookings and Members as table bm */
                (SELECT m.memid AS "memid",b.facid AS "facid",
                    m.surname AS "surname", m.firstname AS "firstname", 
                    b.slots AS "slots"
                    FROM Bookings b JOIN Members m
                    ON b.memid = m.memid
                    AND LEFT(b.starttime,10) = "2012-09-14") bm
                    
                JOIN Facilities f
                ON bm.facid = f.facid
                
                /*when guest, use guestcost otherwise use membercost */
                AND ( CASE 
                        WHEN bm.memid = 0 THEN (f.guestcost * bm.slots) > 30 
                        ELSE (f.membercost * bm.slots) > 30 
                        END )
                        
                ORDER BY cost DESC """
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

     facility_name     member_name   cost
0   Massage Room 2           Guest  320.0
1   Massage Room 1           Guest  160.0
2   Massage Room 1           Guest  160.0
3   Massage Room 1           Guest  160.0
4   Tennis Court 2           Guest  150.0
5   Tennis Court 1           Guest   75.0
6   Tennis Court 2           Guest   75.0
7   Tennis Court 1           Guest   75.0
8     Squash Court           Guest   70.0
9   Massage Room 1  Farrell Jemima   39.6
10    Squash Court           Guest   35.0
11    Squash Court           Guest   35.0
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 4.21 ms

## Q10: Produce a list of facilities with a total revenue less than 1000. The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!

/*av. execution time 0.00158 sec*/

In [75]:
%%time
sql_str = """ SELECT f.name AS "facility_name", 
                SUM( (CASE 
                        WHEN b.memid = 0 THEN (f.guestcost * b.slots) 
                        ELSE (f.membercost * b.slots) 
                        END) ) AS "total_revenue" 
                FROM Bookings b, Facilities f 
                WHERE b.facid = f.facid 
                GROUP BY f.facid
                HAVING total_revenue < 1000
                ORDER BY total_revenue """
with engine.connect() as con:
    rs = con.execute(sql_str)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()
print(df)

   facility_name total_revenue
0   Table Tennis         180.0
1  Snooker Table         240.0
2     Pool Table         270.0
CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 6.86 ms